src/VirtualClient/VirtualClient.Actions.UnitTests/Examples/Memtier/Memtier_Memcached_Results_1.txt
4         Threads
1         Connections per thread
60        Seconds


ALL STATS
============================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p90 Latency     p95 Latency     p99 Latency   p99.9 Latency       KB/sec
------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets         4827.17          ---          ---         2.64323         2.83100         3.93500         4.47900         7.45500        29.56700       329.45
Gets        43444.12     43444.12         1.20         2.61979         2.73500         3.88700         4.41500         7.42300        29.31100      3724.01
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---          ---
Totals      48271.29     43444.12         1.20         2.62213         2.75100         3.90300         4.41500         7.42300        29.31100      4053.46


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.071        0.000
SET       0.359        5.000
SET       0.503       10.000
SET       0.823       15.000
SET       1.231       20.000
SET       1.623       25.000
SET       1.967       30.000
SET       2.239       35.000
SET       2.463       40.000
SET       2.671       45.000
SET       2.831       50.000
SET       2.895       52.500
SET       2.959       55.000
SET       3.007       57.500
SET       3.055       60.000
SET       3.087       62.500
SET       3.135       65.000
SET       3.183       67.500
SET       3.215       70.000
SET       3.279       72.500
SET       3.343       75.000
SET       3.375       76.250
SET       3.407       77.500
SET       3.455       78.750
SET       3.503       80.000
SET       3.551       81.250
SET       3.599       82.500
SET       3.647       83.750
SET       3.695       85.000
SET       3.743       86.250
SET       3.807       87.500
SET       3.839       88.125
SET       3.871       88.750
SET       3.903       89.375
SET       3.935       90.000
SET       3.967       90.625
SET       4.015       91.250
SET       4.079       91.875
SET       4.127       92.500
SET       4.191       93.125
SET       4.287       93.750
SET       4.319       94.062
SET       4.351       94.375
SET       4.415       94.688
SET       4.479       95.000
SET       4.543       95.312
SET       4.607       95.625
SET       4.703       95.938
SET       4.799       96.250
SET       4.927       96.562
SET       5.087       96.875
SET       5.183       97.031
SET       5.279       97.188
SET       5.407       97.344
SET       5.535       97.500
SET       5.663       97.656
SET       5.823       97.812
SET       5.983       97.969
SET       6.143       98.125
SET       6.303       98.281
SET       6.527       98.438
SET       6.623       98.516
SET       6.751       98.594
SET       6.847       98.672
SET       7.007       98.750
SET       7.103       98.828
SET       7.263       98.906
SET       7.423       98.984
SET       7.615       99.062
SET       7.775       99.141
SET       7.999       99.219
SET       8.127       99.258
SET       8.255       99.297
SET       8.383       99.336
SET       8.575       99.375
SET       8.703       99.414
SET       8.959       99.453
SET       9.215       99.492
SET       9.471       99.531
SET       9.855       99.570
SET      10.431       99.609
SET      10.815       99.629
SET      11.455       99.648
SET      12.287       99.668
SET      12.991       99.688
SET      14.079       99.707
SET      15.231       99.727
SET      15.935       99.746
SET      16.767       99.766
SET      17.791       99.785
SET      19.199       99.805
SET      19.711       99.814
SET      20.479       99.824
SET      21.503       99.834
SET      22.143       99.844
SET      23.551       99.854
SET      24.703       99.863
SET      26.367       99.873
SET      27.903       99.883
SET      28.543       99.893
SET      30.079       99.902
SET      30.463       99.907
SET      30.591       99.912
SET      30.975       99.917
SET      31.615       99.922
SET      32.255       99.927
SET      32.767       99.932
SET      33.279       99.937
SET      33.279       99.941
SET      34.047       99.946
SET      34.815       99.951
SET      35.071       99.954
SET      35.839       99.956
SET      36.351       99.958
SET      38.399       99.961
SET      38.911       99.963
SET      39.167       99.966
SET      40.959       99.968
SET      42.751       99.971
SET      43.007       99.973
SET      43.519       99.976
SET      43.775       99.977
SET      44.031       99.978
SET      44.287       99.979
SET      45.055       99.980
SET      45.311       99.982
SET      45.567       99.983
SET      46.335       99.984
SET      47.103       99.985
SET      47.103       99.987
SET      47.359       99.988
SET      49.663       99.988
SET      50.175       99.989
SET      50.687       99.990
SET      51.455       99.990
SET      51.967       99.991
SET      51.967       99.991
SET      51.967       99.992
SET      52.479       99.993
SET      52.479       99.993
SET      53.247       99.994
SET      53.247       99.994
SET      53.503       99.995
SET      53.503       99.995
SET      53.503       99.995
[...]
SET      54.783       99.996
SET      55.039       99.996
SET      55.039       99.996
SET      56.319       99.997
SET      56.319       99.997
SET      56.319       99.997
[...]
SET      56.319       99.998
SET      57.855       99.998
SET      57.855       99.998
SET      58.367       99.998
SET      58.367       99.998
SET      59.135       99.998
SET      59.135       99.998
SET      59.135       99.999
SET      61.439       99.999
SET      61.439       99.999
SET      61.439       99.999
[...]
SET      73.215       99.999
SET      73.215      100.000
---
GET       0.055        0.000
GET       0.391        5.000
GET       0.655       10.000
GET       0.967       15.000
GET       1.311       20.000
GET       1.623       25.000
GET       1.927       30.000
GET       2.175       35.000
GET       2.383       40.000
GET       2.575       45.000
GET       2.735       50.000
GET       2.815       52.500
GET       2.879       55.000
GET       2.943       57.500
GET       3.007       60.000
GET       3.055       62.500
GET       3.103       65.000
GET       3.135       67.500
GET       3.183       70.000
GET       3.231       72.500
GET       3.295       75.000
GET       3.327       76.250
GET       3.359       77.500
GET       3.407       78.750
GET       3.455       80.000
GET       3.503       81.250
GET       3.551       82.500
GET       3.599       83.750
GET       3.647       85.000
GET       3.711       86.250
GET       3.759       87.500
GET       3.791       88.125
GET       3.823       88.750
GET       3.855       89.375
GET       3.887       90.000
GET       3.935       90.625
GET       3.967       91.250
GET       4.015       91.875
GET       4.079       92.500
GET       4.159       93.125
GET       4.223       93.750
GET       4.255       94.062
GET       4.319       94.375
GET       4.351       94.688
GET       4.415       95.000
GET       4.479       95.312
GET       4.543       95.625
GET       4.639       95.938
GET       4.735       96.250
GET       4.863       96.562
GET       5.023       96.875
GET       5.087       97.031
GET       5.183       97.188
GET       5.311       97.344
GET       5.439       97.500
GET       5.599       97.656
GET       5.727       97.812
GET       5.887       97.969
GET       6.047       98.125
GET       6.239       98.281
GET       6.463       98.438
GET       6.559       98.516
GET       6.687       98.594
GET       6.783       98.672
GET       6.911       98.750
GET       7.039       98.828
GET       7.199       98.906
GET       7.359       98.984
GET       7.519       99.062
GET       7.711       99.141
GET       7.935       99.219
GET       8.063       99.258
GET       8.191       99.297
GET       8.319       99.336
GET       8.511       99.375
GET       8.703       99.414
GET       8.895       99.453
GET       9.151       99.492
GET       9.407       99.531
GET       9.791       99.570
GET      10.367       99.609
GET      10.687       99.629
GET      11.327       99.648
GET      12.223       99.668
GET      12.863       99.688
GET      14.015       99.707
GET      15.103       99.727
GET      15.807       99.746
GET      16.767       99.766
GET      17.791       99.785
GET      18.943       99.805
GET      19.583       99.814
GET      20.223       99.824
GET      20.991       99.834
GET      21.887       99.844
GET      22.783       99.854
GET      24.447       99.863
GET      25.855       99.873
GET      27.519       99.883
GET      28.415       99.893
GET      29.567       99.902
GET      30.207       99.907
GET      30.591       99.912
GET      30.975       99.917
GET      31.487       99.922
GET      31.999       99.927
GET      32.383       99.932
GET      33.279       99.937
GET      33.279       99.941
GET      34.047       99.946
GET      34.815       99.951
GET      35.071       99.954
GET      36.095       99.956
GET      36.607       99.958
GET      38.655       99.961
GET      38.911       99.963
GET      39.167       99.966
GET      40.959       99.968
GET      42.495       99.971
GET      42.751       99.973
GET      43.775       99.976
GET      43.775       99.977
GET      44.287       99.978
GET      44.543       99.979
GET      44.543       99.980
GET      45.311       99.982
GET      45.567       99.983
GET      46.335       99.984
GET      46.847       99.985
GET      47.103       99.987
GET      47.871       99.988
GET      49.151       99.988
GET      50.431       99.989
GET      51.455       99.990
GET      51.711       99.990
GET      51.967       99.991
GET      51.967       99.991
GET      51.967       99.992
GET      52.479       99.993
GET      52.479       99.993
GET      53.247       99.994
GET      53.247       99.994
GET      53.503       99.995
GET      53.503       99.995
GET      53.503       99.995
[...]
GET      54.783       99.996
GET      54.783       99.996
GET      55.039       99.996
GET      55.039       99.997
GET      56.319       99.997
GET      56.319       99.997
GET      56.319       99.997
[...]
GET      56.319       99.998
GET      56.319       99.998
GET      57.855       99.998
GET      58.111       99.998
GET      58.367       99.998
GET      58.367       99.998
GET      59.135       99.998
GET      59.903       99.999
GET      60.415       99.999
GET      60.927       99.999
GET      61.439       99.999
GET      61.439       99.999
GET      73.215       99.999
GET      73.215      100.000
---
WAIT      0.000      100.000